Revit 2025 API
FillPatternHostOrientation Enumeration
 The types of orientations for fill patterns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FillPatternHostOrientation
Public Enumeration FillPatternHostOrientation
public enum class FillPatternHostOrientation
type FillPatternHostOrientation
Members
Member name | Value | Description
ToView | 0 |  All patterns share the same orientation and origin with respect to view, so they perfectly align at element transitions.
AsText | 1 |  Mimics the behavior of text. Patterns align with the host and share the same origin with respect to view.
ToHost | 2 |  Patterns align with the host and compute a origin to fit the host.
See Also
Reference
Autodesk.Revit.DB Namespace